InformationRegisters/ПоследняяДатаИзмененияДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПоследняяДатаИзмененияДокумента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоследняяДатаИзмененияДокумента/Ext/ManagerModule.bsl
Процедура ДобавитьОбновитьЗапись(ДокументСсылка) Экспорт	
	МенеджерЗаписей = СоздатьМенеджерЗаписи();
	МенеджерЗаписей.Документ = ДокументСсылка;
	МенеджерЗаписей.Прочитать();
	
	Если МенеджерЗаписей.Выбран() Тогда 
		МенеджерЗаписей.Автор			= ПараметрыСеанса.Пользователь;
		МенеджерЗаписей.ДатаИзменения	= ТекущаяДата();
		МенеджерЗаписей.Записать(Истина);
	Иначе  
		МенеджерЗаписей.Документ		= ДокументСсылка;
		МенеджерЗаписей.Автор			= ПараметрыСеанса.Пользователь;
		МенеджерЗаписей.ДатаИзменения	= ТекущаяДата();
		МенеджерЗаписей.Записать(Истина);
	КонецЕсли;
КонецПроцедуры
	
//	Параметры:
//		ДокументСсылка - ДокументСсылка - Любая ссылка документа
//	Возвращаемое значение:
//		Дата:
//		- Запись присутсвует, вернет заполненную дату
//		- Запись отсутствует, вернет пустую дату (01.01.0001 0:00:00)
функция ПолучитьДатуиИзмененяДокумента(ДокументСсылка) Экспорт	
	ДанныеЗаписи = Получить(Новый Структура("Документ",ДокументСсылка));
	Возврат ДанныеЗаписи.ДатаИзменения	
КонецФункции
